Tekla Open API Reference for Tekla Structures 2025
Weld.Representation Enumeration
 The weld representations.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum Representation
Public Enumeration Representation
Members
Member name | Value | Description
Outline | 1 |  The outline solid representation.
Path | 2 |  The path representation.
See Also
Reference
Tekla.Structures.Drawing Namespace